Revit 2026 API

# ExporterIFCGetFamilyInstanceAssemblyOffset Method

---

Obtains Translation to adjust Family Instance within an Assembly, based on Family Symbol origin change.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetFamilyInstanceAssemblyOffset(
	FamilyInstance familyInstance
)
```
```vb
Public Function GetFamilyInstanceAssemblyOffset (
	familyInstance As FamilyInstance
) As XYZ
```
```cpp
public:
XYZ^ GetFamilyInstanceAssemblyOffset(
	FamilyInstance^ familyInstance
)
```
```fsharp
member GetFamilyInstanceAssemblyOffset :
        familyInstance : FamilyInstance -> XYZ
```

#### Parameters

familyInstance FamilyInstance
     The family instance.

#### Return Value

XYZ Translation for Family Instance.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace